= Frontières Terrestres / World Borders
:neo4j-version: 2.0.0
:author: Matthieu Totet
:twitter: @totetmatt
:tags: World, Border, Fr

The Datasource!
//hide
//setup
[source,cypher]
----
CREATE (Haiti:Country {name:"Haïti"}),
	(Republiquedominicaine:Country {name:"République dominicaine"}),
	(Vatican:Country {name:"Vatican"}),
	(Monaco:Country {name:"Monaco"}),
	(Suriname:Country {name:"Suriname"}),
	(Swaziland:Country {name:"Swaziland"}),
	(Timororiental:Country {name:"Timor oriental"}),
	(Chypre:Country {name:"Chypre"}),
	(SaintMarin:Country {name:"Saint-Marin"}),
	(Uruguay:Country {name:"Uruguay"}),
	(Guyana:Country {name:"Guyana"}),
	(Venezuela:Country {name:"Venezuela"}),
	(Belize:Country {name:"Belize"}),
	(Canada:Country {name:"Canada"}),
	(EtatsUnis:Country {name:"États-Unis"}),
	(CostaRica:Country {name:"Costa Rica"}),
	(Panama:Country {name:"Panama"}),
	(Salvador:Country {name:"Salvador"}),
	(Lesotho:Country {name:"Lesotho"}),
	(Qatar:Country {name:"Qatar"}),
	(Oman:Country {name:"Oman"}),
	(Yemen:Country {name:"Yémen"}),
	(Belgique:Country {name:"Belgique"}),
	(PaysBas:Country {name:"Pays-Bas"}),
	(Suede:Country {name:"Suède"}),
	(PapouasieNouvelleGuinee:Country {name:"Papouasie-Nouvelle-Guinée"}),
	(Tunisie:Country {name:"Tunisie"}),
	(Irlande:Country {name:"Irlande"}),
	(RoyaumeUni:Country {name:"Royaume-Uni"}),
	(GuineeBissau:Country {name:"Guinée-Bissau"}),
	(Liberia:Country {name:"Libéria"}),
	(SierraLeone:Country {name:"Sierra Leone"}),
	(Andorre:Country {name:"Andorre"}),
	(Paraguay:Country {name:"Paraguay"}),
	(Equateur:Country {name:"Équateur"}),
	(Argentine:Country {name:"Argentine"}),
	(Bolivie:Country {name:"Bolivie"}),
	(Guatemala:Country {name:"Guatemala"}),
	(Mexique:Country {name:"Mexique"}),
	(Honduras:Country {name:"Honduras"}),
	(Nicaragua:Country {name:"Nicaragua"}),
	(Zimbabwe:Country {name:"Zimbabwe"}),
	(Koweit:Country {name:"Koweït"}),
	(Danemark:Country {name:"Danemark"}),
	(Finlande:Country {name:"Finlande"}),
	(Norvege:Country {name:"Norvège"}),
	(Turkmenistan:Country {name:"Turkménistan"}),
	(Brunei:Country {name:"Brunei"}),
	(Bhoutan:Country {name:"Bhoutan"}),
	(CoreeduNord:Country {name:"Corée du Nord"}),
	(CoreeduSud:Country {name:"Corée du Sud"}),
	(Nepal:Country {name:"Népal"}),
	(Algerie:Country {name:"Algérie"}),
	(Mauritanie:Country {name:"Mauritanie"}),
	(Espagne:Country {name:"Espagne"}),
	(Portugal:Country {name:"Portugal"}),
	(Maroc:Country {name:"Maroc"}),
	(Saharaoccidental:Country {name:"Sahara occidental"}),
	(Gambie:Country {name:"Gambie"}),
	(Benin:Country {name:"Bénin"}),
	(BurkinaFaso:Country {name:"Burkina Faso"}),
	(CotedIvoire:Country {name:"Côte d'Ivoire"}),
	(Ghana:Country {name:"Ghana"}),
	(Togo:Country {name:"Togo"}),
	(France:Country {name:"France"}),
	(Italie:Country {name:"Italie"}),
	(Bresil:Country {name:"Brésil"}),
	(Colombie:Country {name:"Colombie"}),
	(Chili:Country {name:"Chili"}),
	(Perou:Country {name:"Pérou"}),
	(Ouganda:Country {name:"Ouganda"}),
	(Rwanda:Country {name:"Rwanda"}),
	(Republiquecentrafricaine:Country {name:"République centrafricaine"}),
	(Angola:Country {name:"Angola"}),
	(RepubliqueduCongo:Country {name:"République du Congo"}),
	(Botswana:Country {name:"Botswana"}),
	(Namibie:Country {name:"Namibie"}),
	(Burundi:Country {name:"Burundi"}),
	(Malawi:Country {name:"Malawi"}),
	(Emiratsarabesunis:Country {name:"Émirats arabes unis"}),
	(Armenie:Country {name:"Arménie"}),
	(Kirghizistan:Country {name:"Kirghizistan"}),
	(Tadjikistan:Country {name:"Tadjikistan"}),
	(Liechtenstein:Country {name:"Liechtenstein"}),
	(Suisse:Country {name:"Suisse"}),
	(BosnieHerzegovine:Country {name:"Bosnie-Herzégovine"}),
	(Montenegro:Country {name:"Monténégro"}),
	(Croatie:Country {name:"Croatie"}),
	(Slovenie:Country {name:"Slovénie"}),
	(Estonie:Country {name:"Estonie"}),
	(Lettonie:Country {name:"Lettonie"}),
	(Bielorussie:Country {name:"Biélorussie"}),
	(Lituanie:Country {name:"Lituanie"}),
	(Luxembourg:Country {name:"Luxembourg"}),
	(Kazakhstan:Country {name:"Kazakhstan"}),
	(Ouzbekistan:Country {name:"Ouzbékistan"}),
	(Republiquetcheque:Country {name:"République tchèque"}),
	(Slovaquie:Country {name:"Slovaquie"}),
	(Moldavie:Country {name:"Moldavie"}),
	(Indonesie:Country {name:"Indonésie"}),
	(Malaisie:Country {name:"Malaisie"}),
	(Bangladesh:Country {name:"Bangladesh"}),
	(Cambodge:Country {name:"Cambodge"}),
	(Thailande:Country {name:"Thaïlande"}),
	(Birmanie:Country {name:"Birmanie"}),
	(Laos:Country {name:"Laos"}),
	(Mongolie:Country {name:"Mongolie"}),
	(Guinee:Country {name:"Guinée"}),
	(Senegal:Country {name:"Sénégal"}),
	(Mali:Country {name:"Mali"}),
	(Niger:Country {name:"Niger"}),
	(Cameroun:Country {name:"Cameroun"}),
	(Nigeria:Country {name:"Nigeria"}),
	(Gabon:Country {name:"Gabon"}),
	(Guineeequatoriale:Country {name:"Guinée équatoriale"}),
	(RepubliquedemocratiqueduCongo:Country {name:"République démocratique du Congo"}),
	(Zambie:Country {name:"Zambie"}),
	(Israel:Country {name:"Israël"}),
	(Liban:Country {name:"Liban"}),
	(Jordanie:Country {name:"Jordanie"}),
	(Palestine:Country {name:"Palestine"}),
	(Libye:Country {name:"Libye"}),
	(Egypte:Country {name:"Égypte"}),
	(Soudan:Country {name:"Soudan"}),
	(Tchad:Country {name:"Tchad"}),
	(Kenya:Country {name:"Kenya"}),
	(Tanzanie:Country {name:"Tanzanie"}),
	(Djibouti:Country {name:"Djibouti"}),
	(Somalie:Country {name:"Somalie"}),
	(Erythree:Country {name:"Érythrée"}),
	(AfriqueduSud:Country {name:"Afrique du Sud"}),
	(Mozambique:Country {name:"Mozambique"}),
	(Arabiesaoudite:Country {name:"Arabie saoudite"}),
	(Irak:Country {name:"Irak"}),
	(Albanie:Country {name:"Albanie"}),
	(Macedoine:Country {name:"Macédoine"}),
	(Bulgarie:Country {name:"Bulgarie"}),
	(Grece:Country {name:"Grèce"}),
	(Azerbaidjan:Country {name:"Azerbaïdjan"}),
	(Georgie:Country {name:"Géorgie"}),
	(Syrie:Country {name:"Syrie"}),
	(Turquie:Country {name:"Turquie"}),
	(Afghanistan:Country {name:"Afghanistan"}),
	(Iran:Country {name:"Iran"}),
	(Autriche:Country {name:"Autriche"}),
	(Hongrie:Country {name:"Hongrie"}),
	(Roumanie:Country {name:"Roumanie"}),
	(Serbie:Country {name:"Serbie"}),
	(Allemagne:Country {name:"Allemagne"}),
	(Pologne:Country {name:"Pologne"}),
	(Russie:Country {name:"Russie"}),
	(Ukraine:Country {name:"Ukraine"}),
	(Inde:Country {name:"Inde"}),
	(Pakistan:Country {name:"Pakistan"}),
	(RepubliquepopulairedeChine:Country {name:"République populaire de Chine"}),
	(VietNam:Country {name:"Viêt Nam"}),
	(SoudanduSud:Country {name:"Soudan du Sud"}),
	(Ethiopie:Country {name:"Éthiopie"})CREATE (Haiti)-[:BORDER_WITH {size:360.0}]->(Republiquedominicaine),
	(Chypre)-[:BORDER_WITH {size:152.0}]->(RoyaumeUni),
	(Guyana)-[:BORDER_WITH {size:743.0}]->(Venezuela),
	(Guyana)-[:BORDER_WITH {size:600.0}]->(Suriname),
	(Belize)-[:BORDER_WITH {size:193.0}]->(Mexique),
	(Belize)-[:BORDER_WITH {size:266.0}]->(Guatemala),
	(Canada)-[:BORDER_WITH {size:8893.0}]->(EtatsUnis),
	(CostaRica)-[:BORDER_WITH {size:309.0}]->(Nicaragua),
	(CostaRica)-[:BORDER_WITH {size:330.0}]->(Panama),
	(Oman)-[:BORDER_WITH {size:288.0}]->(Yemen),
	(Oman)-[:BORDER_WITH {size:410.0}]->(Emiratsarabesunis),
	(Belgique)-[:BORDER_WITH {size:620.0}]->(France),
	(Belgique)-[:BORDER_WITH {size:450.0}]->(PaysBas),
	(Belgique)-[:BORDER_WITH {size:148.0}]->(Luxembourg),
	(Irlande)-[:BORDER_WITH {size:360.0}]->(RoyaumeUni),
	(GuineeBissau)-[:BORDER_WITH {size:338.0}]->(Senegal),
	(Liberia)-[:BORDER_WITH {size:306.0}]->(SierraLeone),
	(Andorre)-[:BORDER_WITH {size:57.0}]->(France),
	(Andorre)-[:BORDER_WITH {size:64.0}]->(Espagne),
	(Argentine)-[:BORDER_WITH {size:1224.0}]->(Bresil),
	(Argentine)-[:BORDER_WITH {size:742.0}]->(Bolivie),
	(Argentine)-[:BORDER_WITH {size:5150.0}]->(Chili),
	(Argentine)-[:BORDER_WITH {size:1699.0}]->(Paraguay),
	(Argentine)-[:BORDER_WITH {size:579.0}]->(Uruguay),
	(Bolivie)-[:BORDER_WITH {size:3400.0}]->(Bresil),
	(Bolivie)-[:BORDER_WITH {size:861.0}]->(Chili),
	(Bolivie)-[:BORDER_WITH {size:900.0}]->(Perou),
	(Bolivie)-[:BORDER_WITH {size:750.0}]->(Paraguay),
	(Guatemala)-[:BORDER_WITH {size:959.0}]->(Mexique),
	(Guatemala)-[:BORDER_WITH {size:256.0}]->(Honduras),
	(Guatemala)-[:BORDER_WITH {size:203.0}]->(Salvador),
	(Mexique)-[:BORDER_WITH {size:3141.0}]->(EtatsUnis),
	(Honduras)-[:BORDER_WITH {size:342.0}]->(Nicaragua),
	(Honduras)-[:BORDER_WITH {size:256.0}]->(Salvador),
	(Finlande)-[:BORDER_WITH {size:1340.0}]->(Russie),
	(Finlande)-[:BORDER_WITH {size:736.0}]->(Norvege),
	(Finlande)-[:BORDER_WITH {size:614.0}]->(Suede),
	(Norvege)-[:BORDER_WITH {size:196.0}]->(Russie),
	(Norvege)-[:BORDER_WITH {size:1619.0}]->(Suede),
	(Brunei)-[:BORDER_WITH {size:381.0}]->(Malaisie),
	(Bhoutan)-[:BORDER_WITH {size:470.0}]->(RepubliquepopulairedeChine),
	(Bhoutan)-[:BORDER_WITH {size:605.0}]->(Inde),
	(CoreeduNord)-[:BORDER_WITH {size:1416.0}]->(RepubliquepopulairedeChine),
	(CoreeduNord)-[:BORDER_WITH {size:19.0}]->(Russie),
	(CoreeduNord)-[:BORDER_WITH {size:238.0}]->(CoreeduSud),
	(Nepal)-[:BORDER_WITH {size:1236.0}]->(RepubliquepopulairedeChine),
	(Algerie)-[:BORDER_WITH {size:1376.0}]->(Mali),
	(Algerie)-[:BORDER_WITH {size:956.0}]->(Niger),
	(Algerie)-[:BORDER_WITH {size:463.0}]->(Mauritanie),
	(Algerie)-[:BORDER_WITH {size:982.0}]->(Libye),
	(Algerie)-[:BORDER_WITH {size:1601.0}]->(Maroc),
	(Algerie)-[:BORDER_WITH {size:43.0}]->(Saharaoccidental),
	(Algerie)-[:BORDER_WITH {size:965.0}]->(Tunisie),
	(Mauritanie)-[:BORDER_WITH {size:813.0}]->(Senegal),
	(Mauritanie)-[:BORDER_WITH {size:1561.0}]->(Saharaoccidental),
	(Espagne)-[:BORDER_WITH {size:623.0}]->(France),
	(Espagne)-[:BORDER_WITH {size:16.0}]->(Maroc),
	(Espagne)-[:BORDER_WITH {size:1214.0}]->(Portugal),
	(Espagne)-[:BORDER_WITH {size:1.0}]->(RoyaumeUni),
	(Maroc)-[:BORDER_WITH {size:443.0}]->(Saharaoccidental),
	(Gambie)-[:BORDER_WITH {size:740.0}]->(Senegal),
	(Benin)-[:BORDER_WITH {size:266.0}]->(Niger),
	(Benin)-[:BORDER_WITH {size:773.0}]->(Nigeria),
	(Benin)-[:BORDER_WITH {size:644.0}]->(Togo),
	(BurkinaFaso)-[:BORDER_WITH {size:1000.0}]->(Mali),
	(BurkinaFaso)-[:BORDER_WITH {size:628.0}]->(Niger),
	(BurkinaFaso)-[:BORDER_WITH {size:584.0}]->(CotedIvoire),
	(BurkinaFaso)-[:BORDER_WITH {size:549.0}]->(Ghana),
	(BurkinaFaso)-[:BORDER_WITH {size:306.0}]->(Benin),
	(BurkinaFaso)-[:BORDER_WITH {size:126.0}]->(Togo),
	(CotedIvoire)-[:BORDER_WITH {size:532.0}]->(Mali),
	(CotedIvoire)-[:BORDER_WITH {size:610.0}]->(Guinee),
	(CotedIvoire)-[:BORDER_WITH {size:668.0}]->(Ghana),
	(CotedIvoire)-[:BORDER_WITH {size:716.0}]->(Liberia),
	(Ghana)-[:BORDER_WITH {size:877.0}]->(Togo),
	(France)-[:BORDER_WITH {size:488.0}]->(Italie),
	(France)-[:BORDER_WITH {size:573.0}]->(Suisse),
	(France)-[:BORDER_WITH {size:510.0}]->(Suriname),
	(France)-[:BORDER_WITH {size:10.0}]->(PaysBas),
	(France)-[:BORDER_WITH {size:73.0}]->(Luxembourg),
	(France)-[:BORDER_WITH {size:4.0}]->(Monaco),
	(Italie)-[:BORDER_WITH {size:740.0}]->(Suisse),
	(Italie)-[:BORDER_WITH {size:232.0}]->(Slovenie),
	(Italie)-[:BORDER_WITH {size:39.0}]->(SaintMarin),
	(Italie)-[:BORDER_WITH {size:3.0}]->(Vatican),
	(Bresil)-[:BORDER_WITH {size:1643.0}]->(Colombie),
	(Bresil)-[:BORDER_WITH {size:1560.0}]->(Perou),
	(Bresil)-[:BORDER_WITH {size:2200.0}]->(Venezuela),
	(Bresil)-[:BORDER_WITH {size:730.0}]->(France),
	(Bresil)-[:BORDER_WITH {size:1290.0}]->(Paraguay),
	(Bresil)-[:BORDER_WITH {size:1605.0}]->(Guyana),
	(Bresil)-[:BORDER_WITH {size:593.0}]->(Suriname),
	(Bresil)-[:BORDER_WITH {size:985.0}]->(Uruguay),
	(Colombie)-[:BORDER_WITH {size:1496.0}]->(Perou),
	(Colombie)-[:BORDER_WITH {size:2050.0}]->(Venezuela),
	(Colombie)-[:BORDER_WITH {size:590.0}]->(Equateur),
	(Colombie)-[:BORDER_WITH {size:225.0}]->(Panama),
	(Chili)-[:BORDER_WITH {size:160.0}]->(Perou),
	(Perou)-[:BORDER_WITH {size:1420.0}]->(Equateur),
	(Ouganda)-[:BORDER_WITH {size:765.0}]->(RepubliquedemocratiqueduCongo),
	(Ouganda)-[:BORDER_WITH {size:435.0}]->(SoudanduSud),
	(Ouganda)-[:BORDER_WITH {size:396.0}]->(Tanzanie),
	(Ouganda)-[:BORDER_WITH {size:169.0}]->(Rwanda),
	(Rwanda)-[:BORDER_WITH {size:217.0}]->(RepubliquedemocratiqueduCongo),
	(Rwanda)-[:BORDER_WITH {size:217.0}]->(Tanzanie),
	(Republiquecentrafricaine)-[:BORDER_WITH {size:1577.0}]->(RepubliquedemocratiqueduCongo),
	(Republiquecentrafricaine)-[:BORDER_WITH {size:483.0}]->(Soudan),
	(Republiquecentrafricaine)-[:BORDER_WITH {size:1197.0}]->(Tchad),
	(Republiquecentrafricaine)-[:BORDER_WITH {size:467.0}]->(RepubliqueduCongo),
	(Republiquecentrafricaine)-[:BORDER_WITH {size:682.0}]->(SoudanduSud),
	(Angola)-[:BORDER_WITH {size:2511.0}]->(RepubliquedemocratiqueduCongo),
	(Angola)-[:BORDER_WITH {size:1110.0}]->(Zambie),
	(Angola)-[:BORDER_WITH {size:201.0}]->(RepubliqueduCongo),
	(Angola)-[:BORDER_WITH {size:1376.0}]->(Namibie),
	(RepubliqueduCongo)-[:BORDER_WITH {size:2410.0}]->(RepubliquedemocratiqueduCongo),
	(Botswana)-[:BORDER_WITH {size:2.0}]->(Zambie),
	(Botswana)-[:BORDER_WITH {size:1360.0}]->(Namibie),
	(Botswana)-[:BORDER_WITH {size:813.0}]->(Zimbabwe),
	(Namibie)-[:BORDER_WITH {size:233.0}]->(Zambie),
	(Burundi)-[:BORDER_WITH {size:233.0}]->(RepubliquedemocratiqueduCongo),
	(Burundi)-[:BORDER_WITH {size:451.0}]->(Tanzanie),
	(Burundi)-[:BORDER_WITH {size:290.0}]->(Rwanda),
	(Malawi)-[:BORDER_WITH {size:837.0}]->(Zambie),
	(Malawi)-[:BORDER_WITH {size:1569.0}]->(Mozambique),
	(Malawi)-[:BORDER_WITH {size:475.0}]->(Tanzanie),
	(Armenie)-[:BORDER_WITH {size:35.0}]->(Iran),
	(Armenie)-[:BORDER_WITH {size:268.0}]->(Turquie),
	(Armenie)-[:BORDER_WITH {size:787.0}]->(Azerbaidjan),
	(Armenie)-[:BORDER_WITH {size:164.0}]->(Georgie),
	(Kirghizistan)-[:BORDER_WITH {size:858.0}]->(RepubliquepopulairedeChine),
	(Kirghizistan)-[:BORDER_WITH {size:1099.0}]->(Ouzbekistan),
	(Kirghizistan)-[:BORDER_WITH {size:870.0}]->(Tadjikistan),
	(Liechtenstein)-[:BORDER_WITH {size:41.0}]->(Suisse),
	(BosnieHerzegovine)-[:BORDER_WITH {size:932.0}]->(Croatie),
	(BosnieHerzegovine)-[:BORDER_WITH {size:302.0}]->(Serbie),
	(BosnieHerzegovine)-[:BORDER_WITH {size:225.0}]->(Montenegro),
	(Montenegro)-[:BORDER_WITH {size:203.0}]->(Serbie),
	(Croatie)-[:BORDER_WITH {size:329.0}]->(Hongrie),
	(Croatie)-[:BORDER_WITH {size:241.0}]->(Serbie),
	(Croatie)-[:BORDER_WITH {size:670.0}]->(Slovenie),
	(Croatie)-[:BORDER_WITH {size:25.0}]->(Montenegro),
	(Estonie)-[:BORDER_WITH {size:294.0}]->(Russie),
	(Estonie)-[:BORDER_WITH {size:339.0}]->(Lettonie),
	(Lettonie)-[:BORDER_WITH {size:217.0}]->(Russie),
	(Lettonie)-[:BORDER_WITH {size:453.0}]->(Lituanie),
	(Bielorussie)-[:BORDER_WITH {size:959.0}]->(Russie),
	(Bielorussie)-[:BORDER_WITH {size:891.0}]->(Ukraine),
	(Bielorussie)-[:BORDER_WITH {size:407.0}]->(Pologne),
	(Bielorussie)-[:BORDER_WITH {size:502.0}]->(Lituanie),
	(Bielorussie)-[:BORDER_WITH {size:141.0}]->(Lettonie),
	(Lituanie)-[:BORDER_WITH {size:227.0}]->(Russie),
	(Lituanie)-[:BORDER_WITH {size:91.0}]->(Pologne),
	(Kazakhstan)-[:BORDER_WITH {size:1533.0}]->(RepubliquepopulairedeChine),
	(Kazakhstan)-[:BORDER_WITH {size:6846.0}]->(Russie),
	(Kazakhstan)-[:BORDER_WITH {size:2203.0}]->(Ouzbekistan),
	(Kazakhstan)-[:BORDER_WITH {size:1051.0}]->(Kirghizistan),
	(Kazakhstan)-[:BORDER_WITH {size:379.0}]->(Turkmenistan),
	(Ouzbekistan)-[:BORDER_WITH {size:1621.0}]->(Turkmenistan),
	(Ouzbekistan)-[:BORDER_WITH {size:1161.0}]->(Tadjikistan),
	(Republiquetcheque)-[:BORDER_WITH {size:215.0}]->(Slovaquie),
	(Slovaquie)-[:BORDER_WITH {size:97.0}]->(Ukraine),
	(Moldavie)-[:BORDER_WITH {size:939.0}]->(Ukraine),
	(Moldavie)-[:BORDER_WITH {size:450.0}]->(Roumanie),
	(Indonesie)-[:BORDER_WITH {size:1782.0}]->(Malaisie),
	(Indonesie)-[:BORDER_WITH {size:820.0}]->(PapouasieNouvelleGuinee),
	(Indonesie)-[:BORDER_WITH {size:228.0}]->(Timororiental),
	(Malaisie)-[:BORDER_WITH {size:506.0}]->(Thailande),
	(Bangladesh)-[:BORDER_WITH {size:4053.0}]->(Inde),
	(Bangladesh)-[:BORDER_WITH {size:193.0}]->(Birmanie),
	(Cambodge)-[:BORDER_WITH {size:541.0}]->(Laos),
	(Cambodge)-[:BORDER_WITH {size:803.0}]->(Thailande),
	(Cambodge)-[:BORDER_WITH {size:1228.0}]->(VietNam),
	(Birmanie)-[:BORDER_WITH {size:2185.0}]->(RepubliquepopulairedeChine),
	(Birmanie)-[:BORDER_WITH {size:1463.0}]->(Inde),
	(Birmanie)-[:BORDER_WITH {size:235.0}]->(Laos),
	(Birmanie)-[:BORDER_WITH {size:1800.0}]->(Thailande),
	(Laos)-[:BORDER_WITH {size:423.0}]->(RepubliquepopulairedeChine),
	(Laos)-[:BORDER_WITH {size:1754.0}]->(Thailande),
	(Laos)-[:BORDER_WITH {size:2130.0}]->(VietNam),
	(Mongolie)-[:BORDER_WITH {size:4677.0}]->(RepubliquepopulairedeChine),
	(Mongolie)-[:BORDER_WITH {size:3485.0}]->(Russie),
	(Guinee)-[:BORDER_WITH {size:858.0}]->(Mali),
	(Guinee)-[:BORDER_WITH {size:330.0}]->(Senegal),
	(Guinee)-[:BORDER_WITH {size:563.0}]->(Liberia),
	(Guinee)-[:BORDER_WITH {size:652.0}]->(SierraLeone),
	(Guinee)-[:BORDER_WITH {size:386.0}]->(GuineeBissau),
	(Mali)-[:BORDER_WITH {size:821.0}]->(Niger),
	(Mali)-[:BORDER_WITH {size:2237.0}]->(Mauritanie),
	(Mali)-[:BORDER_WITH {size:419.0}]->(Senegal),
	(Niger)-[:BORDER_WITH {size:1175.0}]->(Tchad),
	(Niger)-[:BORDER_WITH {size:1497.0}]->(Nigeria),
	(Cameroun)-[:BORDER_WITH {size:1094.0}]->(Tchad),
	(Cameroun)-[:BORDER_WITH {size:523.0}]->(RepubliqueduCongo),
	(Cameroun)-[:BORDER_WITH {size:1690.0}]->(Nigeria),
	(Cameroun)-[:BORDER_WITH {size:298.0}]->(Gabon),
	(Cameroun)-[:BORDER_WITH {size:189.0}]->(Guineeequatoriale),
	(Nigeria)-[:BORDER_WITH {size:87.0}]->(Tchad),
	(Gabon)-[:BORDER_WITH {size:1903.0}]->(RepubliqueduCongo),
	(Gabon)-[:BORDER_WITH {size:350.0}]->(Guineeequatoriale),
	(RepubliquedemocratiqueduCongo)-[:BORDER_WITH {size:1930.0}]->(Zambie),
	(RepubliquedemocratiqueduCongo)-[:BORDER_WITH {size:628.0}]->(SoudanduSud),
	(RepubliquedemocratiqueduCongo)-[:BORDER_WITH {size:459.0}]->(Tanzanie),
	(Zambie)-[:BORDER_WITH {size:797.0}]->(Zimbabwe),
	(Israel)-[:BORDER_WITH {size:266.0}]->(Egypte),
	(Israel)-[:BORDER_WITH {size:76.0}]->(Syrie),
	(Israel)-[:BORDER_WITH {size:238.0}]->(Jordanie),
	(Israel)-[:BORDER_WITH {size:358.0}]->(Palestine),
	(Israel)-[:BORDER_WITH {size:79.0}]->(Liban),
	(Liban)-[:BORDER_WITH {size:375.0}]->(Syrie),
	(Jordanie)-[:BORDER_WITH {size:375.0}]->(Syrie),
	(Jordanie)-[:BORDER_WITH {size:97.0}]->(Palestine),
	(Palestine)-[:BORDER_WITH {size:11.0}]->(Egypte),
	(Libye)-[:BORDER_WITH {size:383.0}]->(Soudan),
	(Libye)-[:BORDER_WITH {size:1055.0}]->(Tchad),
	(Libye)-[:BORDER_WITH {size:354.0}]->(Niger),
	(Libye)-[:BORDER_WITH {size:1115.0}]->(Egypte),
	(Libye)-[:BORDER_WITH {size:459.0}]->(Tunisie),
	(Soudan)-[:BORDER_WITH {size:1360.0}]->(Tchad),
	(Soudan)-[:BORDER_WITH {size:723.0}]->(Ethiopie),
	(Soudan)-[:BORDER_WITH {size:1937.0}]->(SoudanduSud),
	(Soudan)-[:BORDER_WITH {size:1273.0}]->(Egypte),
	(Soudan)-[:BORDER_WITH {size:605.0}]->(Erythree),
	(Kenya)-[:BORDER_WITH {size:861.0}]->(Ethiopie),
	(Kenya)-[:BORDER_WITH {size:232.0}]->(SoudanduSud),
	(Kenya)-[:BORDER_WITH {size:769.0}]->(Tanzanie),
	(Kenya)-[:BORDER_WITH {size:933.0}]->(Ouganda),
	(Kenya)-[:BORDER_WITH {size:682.0}]->(Somalie),
	(Tanzanie)-[:BORDER_WITH {size:338.0}]->(Zambie),
	(Djibouti)-[:BORDER_WITH {size:349.0}]->(Ethiopie),
	(Djibouti)-[:BORDER_WITH {size:58.0}]->(Somalie),
	(Djibouti)-[:BORDER_WITH {size:109.0}]->(Erythree),
	(Somalie)-[:BORDER_WITH {size:1600.0}]->(Ethiopie),
	(Erythree)-[:BORDER_WITH {size:912.0}]->(Ethiopie),
	(AfriqueduSud)-[:BORDER_WITH {size:491.0}]->(Mozambique),
	(AfriqueduSud)-[:BORDER_WITH {size:1840.0}]->(Botswana),
	(AfriqueduSud)-[:BORDER_WITH {size:967.0}]->(Namibie),
	(AfriqueduSud)-[:BORDER_WITH {size:225.0}]->(Zimbabwe),
	(AfriqueduSud)-[:BORDER_WITH {size:909.0}]->(Lesotho),
	(AfriqueduSud)-[:BORDER_WITH {size:430.0}]->(Swaziland),
	(Mozambique)-[:BORDER_WITH {size:419.0}]->(Zambie),
	(Mozambique)-[:BORDER_WITH {size:756.0}]->(Tanzanie),
	(Mozambique)-[:BORDER_WITH {size:1231.0}]->(Zimbabwe),
	(Mozambique)-[:BORDER_WITH {size:105.0}]->(Swaziland),
	(Arabiesaoudite)-[:BORDER_WITH {size:814.0}]->(Irak),
	(Arabiesaoudite)-[:BORDER_WITH {size:1458.0}]->(Yemen),
	(Arabiesaoudite)-[:BORDER_WITH {size:744.0}]->(Jordanie),
	(Arabiesaoudite)-[:BORDER_WITH {size:676.0}]->(Oman),
	(Arabiesaoudite)-[:BORDER_WITH {size:457.0}]->(Emiratsarabesunis),
	(Arabiesaoudite)-[:BORDER_WITH {size:222.0}]->(Koweit),
	(Arabiesaoudite)-[:BORDER_WITH {size:60.0}]->(Qatar),
	(Irak)-[:BORDER_WITH {size:1458.0}]->(Iran),
	(Irak)-[:BORDER_WITH {size:352.0}]->(Turquie),
	(Irak)-[:BORDER_WITH {size:605.0}]->(Syrie),
	(Irak)-[:BORDER_WITH {size:181.0}]->(Jordanie),
	(Irak)-[:BORDER_WITH {size:240.0}]->(Koweit),
	(Albanie)-[:BORDER_WITH {size:115.0}]->(Serbie),
	(Albanie)-[:BORDER_WITH {size:282.0}]->(Grece),
	(Albanie)-[:BORDER_WITH {size:151.0}]->(Macedoine),
	(Albanie)-[:BORDER_WITH {size:172.0}]->(Montenegro),
	(Macedoine)-[:BORDER_WITH {size:221.0}]->(Serbie),
	(Bulgarie)-[:BORDER_WITH {size:240.0}]->(Turquie),
	(Bulgarie)-[:BORDER_WITH {size:608.0}]->(Roumanie),
	(Bulgarie)-[:BORDER_WITH {size:318.0}]->(Serbie),
	(Bulgarie)-[:BORDER_WITH {size:494.0}]->(Grece),
	(Bulgarie)-[:BORDER_WITH {size:148.0}]->(Macedoine),
	(Grece)-[:BORDER_WITH {size:206.0}]->(Turquie),
	(Grece)-[:BORDER_WITH {size:246.0}]->(Macedoine),
	(Azerbaidjan)-[:BORDER_WITH {size:284.0}]->(Russie),
	(Azerbaidjan)-[:BORDER_WITH {size:611.0}]->(Iran),
	(Azerbaidjan)-[:BORDER_WITH {size:322.0}]->(Georgie),
	(Georgie)-[:BORDER_WITH {size:723.0}]->(Russie),
	(Georgie)-[:BORDER_WITH {size:252.0}]->(Turquie),
	(Syrie)-[:BORDER_WITH {size:822.0}]->(Turquie),
	(Afghanistan)-[:BORDER_WITH {size:76.0}]->(RepubliquepopulairedeChine),
	(Afghanistan)-[:BORDER_WITH {size:2430.0}]->(Pakistan),
	(Afghanistan)-[:BORDER_WITH {size:137.0}]->(Ouzbekistan),
	(Afghanistan)-[:BORDER_WITH {size:936.0}]->(Iran),
	(Afghanistan)-[:BORDER_WITH {size:744.0}]->(Turkmenistan),
	(Afghanistan)-[:BORDER_WITH {size:1206.0}]->(Tadjikistan),
	(Iran)-[:BORDER_WITH {size:909.0}]->(Pakistan),
	(Iran)-[:BORDER_WITH {size:992.0}]->(Turkmenistan),
	(Iran)-[:BORDER_WITH {size:499.0}]->(Turquie),
	(Autriche)-[:BORDER_WITH {size:366.0}]->(Hongrie),
	(Autriche)-[:BORDER_WITH {size:430.0}]->(Italie),
	(Autriche)-[:BORDER_WITH {size:362.0}]->(Republiquetcheque),
	(Autriche)-[:BORDER_WITH {size:164.0}]->(Suisse),
	(Autriche)-[:BORDER_WITH {size:91.0}]->(Slovaquie),
	(Autriche)-[:BORDER_WITH {size:330.0}]->(Slovenie),
	(Autriche)-[:BORDER_WITH {size:35.0}]->(Liechtenstein),
	(Hongrie)-[:BORDER_WITH {size:103.0}]->(Ukraine),
	(Hongrie)-[:BORDER_WITH {size:443.0}]->(Roumanie),
	(Hongrie)-[:BORDER_WITH {size:151.0}]->(Serbie),
	(Hongrie)-[:BORDER_WITH {size:677.0}]->(Slovaquie),
	(Hongrie)-[:BORDER_WITH {size:102.0}]->(Slovenie),
	(Roumanie)-[:BORDER_WITH {size:531.0}]->(Ukraine),
	(Roumanie)-[:BORDER_WITH {size:476.0}]->(Serbie),
	(Allemagne)-[:BORDER_WITH {size:451.0}]->(France),
	(Allemagne)-[:BORDER_WITH {size:456.0}]->(Pologne),
	(Allemagne)-[:BORDER_WITH {size:784.0}]->(Autriche),
	(Allemagne)-[:BORDER_WITH {size:646.0}]->(Republiquetcheque),
	(Allemagne)-[:BORDER_WITH {size:334.0}]->(Suisse),
	(Allemagne)-[:BORDER_WITH {size:167.0}]->(Belgique),
	(Allemagne)-[:BORDER_WITH {size:577.0}]->(PaysBas),
	(Allemagne)-[:BORDER_WITH {size:138.0}]->(Luxembourg),
	(Allemagne)-[:BORDER_WITH {size:68.0}]->(Danemark),
	(Pologne)-[:BORDER_WITH {size:206.0}]->(Russie),
	(Pologne)-[:BORDER_WITH {size:526.0}]->(Ukraine),
	(Pologne)-[:BORDER_WITH {size:658.0}]->(Republiquetcheque),
	(Pologne)-[:BORDER_WITH {size:444.0}]->(Slovaquie),
	(Russie)-[:BORDER_WITH {size:4250.0}]->(RepubliquepopulairedeChine),
	(Russie)-[:BORDER_WITH {size:1576.0}]->(Ukraine),
	(Inde)-[:BORDER_WITH {size:3380.0}]->(RepubliquepopulairedeChine),
	(Inde)-[:BORDER_WITH {size:2912.0}]->(Pakistan),
	(Inde)-[:BORDER_WITH {size:1690.0}]->(Nepal),
	(Pakistan)-[:BORDER_WITH {size:523.0}]->(RepubliquepopulairedeChine),
	(RepubliquepopulairedeChine)-[:BORDER_WITH {size:1281.0}]->(VietNam),
	(RepubliquepopulairedeChine)-[:BORDER_WITH {size:414.0}]->(Tadjikistan),
	(SoudanduSud)-[:BORDER_WITH {size:883.0}]->(Ethiopie)
----

== Get borders for a country
[source,cypher]
----
MATCH (n {name:"France"})-[b:BORDER_WITH]-(m)
RETURN m.name,b.size
----

//table

== Get borders with a size greater or equal to 1000 km
[source,cypher]
----
MATCH (n)-[b:BORDER_WITH]->(m)
WHERE b.size >= 1000
RETURN n.name,m.name,b.size
----
//table

== Get Shortest Path(s) from one country to another
//output
[source,cypher]
----
MATCH p = allShortestPaths(
(n {name:"Canada"})-[:BORDER_WITH]-(m {name:"Mongolie"}))
RETURN [n in nodes(p) | n.name], length(p)
----
//table


//hide
//graph

++++
<img src="http://matthieu-totet.fr/Koumin/wp-content/uploads/2013/06/WorldBorder.jpg"/>
++++
